---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.SteelElemContourSide2dist
source: html/a74cbafa-df20-c646-108b-250e404a6847.htm
---
# Autodesk.Revit.DB.ParameterTypeId.SteelElemContourSide2dist Property

"Boundary distance 2"

## Syntax (C#)
```csharp
public static ForgeTypeId SteelElemContourSide2dist { get; }
```